local card_data = {
    {"杀", "basic", {
        {"黑桃", {7, 8, 8, 9, 9, 10, 10}},
        {"梅花", {2, 3, 4, 5, 6, 7, 8, 8, 9, 9, 10, 10, 11, 11}}, 
        {"红桃", {10, 10, 11}}, 
        {"方块", {6, 7, 8, 9, 10, 13}}
        }
    },
    {"闪", "basic", {
        {"红桃", {2, 2, 13}}, 
        {"方块", {2, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 11}}
        }
    },
    {"桃", "basic", {
        {"红桃", {3, 4, 6, 7, 8, 9, 12}}, 
        {"方块", {12}}
        }
    },
    {"南蛮入侵", "tactic", {
        {"黑桃", {7, 13}},
        {"梅花", {7}}
        }
    }, 
    {"万箭齐发", "tactic", {{"红桃", {1}}}}, 
    {"桃园结义", "tactic", {{"红桃", {1}}}}, 
    {"五谷丰登", "tactic", {{"红桃", {3, 4}}}}, 
    {"闪电", "tactic", {
        {"黑桃", {1}}, 
        {"红桃", {12}}
        }
    }, 
    {"乐不思蜀", "tactic", {
        {"黑桃", {6}},
        {"红桃", {6}},
        {"梅花", {6}}
        }
    }, 
    {"无懈可击", "tactic", {
        {"黑桃", {11}},
        {"梅花", {12, 13}},
        {"方块", {12}}
        }
    }, 
    {"顺手牵羊", "tactic", {
        {"黑桃", {3, 4, 11}},
        {"方块", {3, 4}}
        }
    }, 
    {"过河拆桥", "tactic", {
        {"黑桃", {3, 4, 12}},
        {"红桃", {12}},
        {"梅花", {3, 4}}
        }
    }, 
    {"决斗", "tactic", {
        {"黑桃", {1}},
        {"梅花", {1}},
        {"方块", {1}}
        }
    }, 
    {"无中生有", "tactic", {{"红桃", {7, 8, 9, 11}}}}, 
    {"借刀杀人", "tactic", {{"梅花", {12, 13}}}},
    {"诸葛连弩", "arm", {
        {"梅花", {1}},
        {"方块", {1}}
        },
        1
    },
    {"寒冰剑", "arm", {{"黑桃", {2}}}, 2},
    {"青釭剑", "arm", {{"黑桃", {6}}}, 2},
    {"雌雄双股剑", "arm", {{"黑桃", {2}}}, 2},
    {"贯石斧", "arm", {{"方块", {5}}}, 3},
    {"青龙偃月刀", "arm", {{"黑桃", {5}}}, 3},
    {"丈八蛇矛", "arm", {{"黑桃", {12}}}, 3},
    {"方天画戟","arm",  {{"方块", {12}}}, 4},
    {"麒麟弓", "arm", {{"红桃", {5}}}, 5},
    {"八卦阵", "armor", {
        {"黑桃", {2}},
        {"梅花", {2}}
        }
    },
    {"仁王盾", "armor", {{"梅花", {2}}}},
    {"的卢", "add_dis_horse", {{"梅花", {5}}}},
    {"绝影", "add_dis_horse", {{"黑桃", {5}}}},
    {"爪黄飞电", "add_dis_horse", {{"红桃", {13}}}},
    {"赤兔", "sub_dis_horse", {{"红桃", {5}}}},
    {"紫骍", "sub_dis_horse", {{"方块", {13}}}},
    {"大宛", "sub_dis_horse", {{"黑桃", {13}}}}
}

local file = io.open("card_m.lua", "w")
io.output(file) -- 设置默认输出文件
local card_id = 1
local s = "card_m = {}\n\n"
io.write(s)
for _, v1 in ipairs(card_data) do
    local name = v1[1]
    for _, v2 in pairs(v1[3]) do
        for _, v3 in ipairs(v2[2]) do
            if #v1 == 3 then
                s = string.format("card_m[%d] = { name = \"%s\", type = \"%s\", suit = \"%s\", points = %d, id = %d }\n", card_id, name, v1[2], v2[1], v3, card_id)
            elseif #v1 == 4 then    
                s = string.format("card_m[%d] = { name = \"%s\", type = \"%s\", range = %d, suit = \"%s\", points = %d, id = %d }\n", card_id, name, v1[2], v1[4], v2[1], v3, card_id)
            end
            io.write(s)
            card_id = card_id + 1
        end
    end    
end
s = "\nreturn card_m"
io.write(s)
io.close()